result/20k_load_16_20_5_2_2_10.txt
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    75.69ms   34.87ms 163.21ms   63.16%
    Req/Sec     0.00      0.00     0.00    100.00%
  95 requests in 10.00s, 1.88MB read
Requests/sec:      9.50
Transfer/sec:    192.67KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.30ms   33.84ms 184.55ms   66.18%
    Req/Sec     0.00      0.00     0.00    100.00%
  87 requests in 10.16s, 1.72MB read
Requests/sec:      8.56
Transfer/sec:    173.09KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.86ms   35.52ms 170.12ms   68.42%
    Req/Sec     0.00      0.00     0.00    100.00%
  75 requests in 10.00s, 1.49MB read
Requests/sec:      7.50
Transfer/sec:    152.35KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    76.81ms   34.05ms 166.23ms   66.92%
    Req/Sec     0.00      0.00     0.00    100.00%
  62 requests in 10.00s, 1.22MB read
Requests/sec:      6.20
Transfer/sec:    125.29KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.24ms   35.41ms 178.00ms   77.44%
    Req/Sec     0.00      0.00     0.00    100.00%
  58 requests in 10.00s, 1.15MB read
Requests/sec:      5.80
Transfer/sec:    117.92KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.65ms   51.76ms 313.41ms   76.74%
    Req/Sec     0.00      0.00     0.00    100.00%
  51 requests in 10.00s, 1.01MB read
Requests/sec:      5.10
Transfer/sec:    103.05KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.28ms   50.85ms 233.27ms   76.69%
    Req/Sec     0.00      0.00     0.00    100.00%
  53 requests in 10.00s, 1.05MB read
Requests/sec:      5.30
Transfer/sec:    107.07KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    97.42ms   62.24ms 293.03ms   70.50%
    Req/Sec     0.00      0.00     0.00    100.00%
  47 requests in 10.00s, 0.93MB read
Requests/sec:      4.70
Transfer/sec:     94.98KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    98.48ms   58.23ms 299.05ms   79.55%
    Req/Sec     0.00      0.00     0.00    100.00%
  46 requests in 10.00s, 0.91MB read
Requests/sec:      4.60
Transfer/sec:     92.94KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.29ms   53.70ms 242.55ms   76.12%
    Req/Sec     0.00      0.00     0.00    100.00%
  43 requests in 10.00s, 0.86MB read
Requests/sec:      4.30
Transfer/sec:     87.64KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.12ms   56.73ms 264.77ms   76.87%
    Req/Sec     0.00      0.00     0.00    100.00%
  43 requests in 10.00s, 0.86MB read
Requests/sec:      4.30
Transfer/sec:     87.71KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   108.87ms   56.72ms 252.13ms   67.65%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.80KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    94.11ms   48.11ms 224.12ms   77.10%
    Req/Sec     0.00      0.00     0.00    100.00%
  38 requests in 10.00s, 768.02KB read
Requests/sec:      3.80
Transfer/sec:     76.78KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.79ms   48.25ms 181.52ms   59.56%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.81KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   116.89ms   52.98ms 214.75ms   66.42%
    Req/Sec     0.00      0.00     0.00    100.00%
  38 requests in 10.00s, 768.02KB read
Requests/sec:      3.80
Transfer/sec:     76.78KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.03ms   39.03ms 156.73ms   62.04%
    Req/Sec     0.00      0.00     0.00    100.00%
  41 requests in 10.00s, 828.65KB read
Requests/sec:      4.10
Transfer/sec:     82.83KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    76.89ms   68.28ms 253.62ms   76.34%
    Req/Sec     0.00      0.00     0.00    100.00%
  22 requests in 10.00s, 444.64KB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:      2.20
Transfer/sec:     44.45KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.85ms  123.78ms 387.17ms   64.66%
    Req/Sec     0.00      0.00     0.00    100.00%
  18 requests in 10.00s, 363.80KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.80
Transfer/sec:     36.36KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   186.90ms   79.84ms 255.27ms   76.87%
    Req/Sec     0.00      0.00     0.00    100.00%
  10 requests in 10.00s, 202.11KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      1.00
Transfer/sec:     20.21KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    54.52ms   41.28ms 162.53ms   76.69%
    Req/Sec     0.00      0.00     0.00    100.00%
  8 requests in 10.00s, 161.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.80
Transfer/sec:     16.16KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.90ms   49.80ms 189.83ms   85.82%
    Req/Sec     0.00      0.00     0.00    100.00%
  8 requests in 10.00s, 161.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.80
Transfer/sec:     16.17KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   227.92ms  112.99ms 338.53ms   73.97%
    Req/Sec     0.00      0.00     0.00    100.00%
  14 requests in 12.00s, 282.95KB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:      1.17
Transfer/sec:     23.58KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   102.22ms   50.15ms 228.15ms   76.15%
    Req/Sec     0.00      0.00     0.00    100.00%
  41 requests in 10.00s, 828.65KB read
Requests/sec:      4.10
Transfer/sec:     82.84KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.00ms   13.35ms  49.31ms   94.78%
    Req/Sec     0.00      0.00     0.00    100.00%
  2 requests in 10.00s, 40.42KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.20
Transfer/sec:      4.04KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.73ms   44.87ms 242.38ms   71.88%
    Req/Sec     0.00      0.00     0.00    100.00%
  40 requests in 10.00s, 808.44KB read
Requests/sec:      4.00
Transfer/sec:     80.81KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    96.25ms   49.38ms 199.17ms   63.50%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.81KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    89.69ms   41.75ms 190.50ms   71.76%
    Req/Sec     0.00      0.00     0.00    100.00%
  38 requests in 10.00s, 768.02KB read
Requests/sec:      3.80
Transfer/sec:     76.80KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   119.31ms   55.69ms 248.05ms   72.73%
    Req/Sec     0.00      0.00     0.00    100.00%
  36 requests in 10.00s, 727.59KB read
Requests/sec:      3.60
Transfer/sec:     72.73KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   125.46ms   47.32ms 223.44ms   77.37%
    Req/Sec     0.00      0.00     0.00    100.00%
  34 requests in 10.00s, 687.17KB read
Requests/sec:      3.40
Transfer/sec:     68.70KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   124.87ms   58.47ms 243.10ms   71.85%
    Req/Sec     0.00      0.00     0.00    100.00%
  32 requests in 10.00s, 646.75KB read
Requests/sec:      3.20
Transfer/sec:     64.66KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   123.82ms   59.17ms 222.22ms   60.90%
    Req/Sec     0.00      0.00     0.00    100.00%
  30 requests in 10.00s, 606.33KB read
Requests/sec:      3.00
Transfer/sec:     60.62KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   106.73ms   44.88ms 203.76ms   70.15%
    Req/Sec     0.00      0.00     0.00    100.00%
  31 requests in 10.00s, 626.54KB read
Requests/sec:      3.10
Transfer/sec:     62.64KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   116.25ms   60.84ms 230.25ms   69.85%
    Req/Sec     0.00      0.00     0.00    100.00%
  31 requests in 10.00s, 626.54KB read
Requests/sec:      3.10
Transfer/sec:     62.64KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   233.04ms  117.46ms 373.70ms   51.88%
    Req/Sec     0.00      0.00     0.00    100.00%
  14 requests in 10.00s, 282.95KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.40
Transfer/sec:     28.29KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   166.85ms   49.89ms 204.48ms   83.58%
    Req/Sec     0.00      0.00     0.00    100.00%
  12 requests in 10.00s, 242.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.20
Transfer/sec:     24.25KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   178.39ms   75.03ms 284.81ms   54.74%
    Req/Sec     0.00      0.00     0.00    100.00%
  8 requests in 10.00s, 161.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.80
Transfer/sec:     16.16KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    99.24ms   41.91ms 145.40ms   48.46%
    Req/Sec     0.00      0.00     0.00    100.00%
  8 requests in 10.00s, 161.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.80
Transfer/sec:     16.16KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.26ms   92.90ms 285.20ms   49.25%
    Req/Sec     0.00      0.00     0.00    100.00%
  6 requests in 10.00s, 121.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.60
Transfer/sec:     12.12KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   226.55ms   91.15ms 277.95ms   81.06%
    Req/Sec     0.00      0.00     0.00    100.00%
  6 requests in 10.00s, 121.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.60
Transfer/sec:     12.12KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   164.85ms   59.22ms 239.92ms   84.33%
    Req/Sec     0.00      0.00     0.00    100.00%
  4 requests in 10.00s, 80.84KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.40
Transfer/sec:      8.08KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    83.00ms   31.00ms 108.37ms   90.91%
    Req/Sec     0.00      0.00     0.00    100.00%
  2 requests in 10.00s, 40.42KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.20
Transfer/sec:      4.04KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.87ms   43.82ms 176.54ms   71.11%
    Req/Sec     0.00      0.00     0.00    100.00%
  37 requests in 10.00s, 747.80KB read
Requests/sec:      3.70
Transfer/sec:     74.77KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   172.62ms   52.79ms 206.35ms   92.54%
    Req/Sec     0.00      0.00     0.00    100.00%
  2 requests in 10.00s, 40.42KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.20
Transfer/sec:      4.04KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    91.21ms   54.56ms 204.18ms   59.85%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.80KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.74ms   43.97ms 192.70ms   71.32%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.81KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    94.64ms   41.34ms 185.19ms   70.68%
    Req/Sec     0.00      0.00     0.00    100.00%
  38 requests in 10.00s, 768.02KB read
Requests/sec:      3.80
Transfer/sec:     76.78KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   102.02ms   53.94ms 275.12ms   77.78%
    Req/Sec     0.00      0.00     0.00    100.00%
  35 requests in 10.00s, 707.59KB read
Requests/sec:      3.50
Transfer/sec:     70.75KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   100.40ms   44.07ms 202.65ms   66.92%
    Req/Sec     0.00      0.00     0.00    100.00%
  36 requests in 10.00s, 727.59KB read
Requests/sec:      3.60
Transfer/sec:     72.73KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   107.34ms   58.93ms 278.55ms   81.95%
    Req/Sec     0.00      0.00     0.00    100.00%
  34 requests in 10.00s, 687.17KB read
Requests/sec:      3.40
Transfer/sec:     68.71KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   115.49ms   53.83ms 224.62ms   67.69%
    Req/Sec     0.00      0.00     0.00    100.00%
  35 requests in 10.00s, 707.38KB read
Requests/sec:      3.50
Transfer/sec:     70.71KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.73ms   57.52ms 255.32ms   76.74%
    Req/Sec     0.00      0.00     0.00    100.00%
  32 requests in 10.00s, 646.75KB read
Requests/sec:      3.20
Transfer/sec:     64.65KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    91.58ms   50.42ms 199.12ms   64.62%
    Req/Sec     0.00      0.00     0.00    100.00%
  30 requests in 10.00s, 606.33KB read
Requests/sec:      3.00
Transfer/sec:     60.61KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.01s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   154.46ms   53.40ms 269.72ms   78.57%
    Req/Sec     0.00      0.00     0.00    100.00%
  16 requests in 10.00s, 323.38KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.60
Transfer/sec:     32.33KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   166.57ms  103.58ms 315.94ms   68.66%
    Req/Sec     0.00      0.00     0.00    100.00%
  14 requests in 10.00s, 282.95KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.40
Transfer/sec:     28.28KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   146.71ms  124.05ms 348.18ms   68.70%
    Req/Sec     0.00      0.00     0.00    100.00%
  14 requests in 10.00s, 282.95KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.40
Transfer/sec:     28.29KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.97ms   37.32ms 158.46ms   69.70%
    Req/Sec     0.00      0.00     0.00    100.00%
  39 requests in 10.00s, 788.23KB read
Requests/sec:      3.90
Transfer/sec:     78.80KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.79ms   77.63ms 252.49ms   80.74%
    Req/Sec     0.00      0.00     0.00    100.00%
  12 requests in 10.00s, 242.53KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.20
Transfer/sec:     24.25KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    84.74ms   57.75ms 202.89ms   55.30%
    Req/Sec     0.00      0.00     0.00    100.00%
  22 requests in 10.00s, 444.64KB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:      2.20
Transfer/sec:     44.45KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.47ms   51.42ms 204.00ms   69.92%
    Req/Sec     0.00      0.00     0.00    100.00%
  21 requests in 10.00s, 424.43KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      2.10
Transfer/sec:     42.43KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.65ms   63.05ms 250.81ms   53.03%
    Req/Sec     0.00      0.00     0.00    100.00%
  8 requests in 10.00s, 161.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.80
Transfer/sec:     16.16KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.62ms   31.15ms 145.18ms   81.06%
    Req/Sec     0.00      0.00     0.00    100.00%
  6 requests in 10.00s, 121.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.60
Transfer/sec:     12.12KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.15ms   55.35ms 205.03ms   80.31%
    Req/Sec     0.00      0.00     0.00    100.00%
  17 requests in 10.00s, 343.59KB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:      1.70
Transfer/sec:     34.36KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   134.46ms   64.48ms 203.13ms   48.91%
    Req/Sec     0.00      0.00     0.00    100.00%
  6 requests in 10.00s, 121.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      0.60
Transfer/sec:     12.12KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.03ms   40.21ms 167.49ms   66.67%
    Req/Sec     0.00      0.00     0.00    100.00%
  53 requests in 10.00s, 1.05MB read
Requests/sec:      5.30
Transfer/sec:    107.11KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   204.98ms   71.47ms 264.49ms   86.36%
    Req/Sec     0.00      0.00     0.00    100.00%
  4 requests in 10.00s, 80.84KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.40
Transfer/sec:      8.08KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    65.08ms   31.51ms 174.81ms   80.43%
    Req/Sec     0.00      0.00     0.00    100.00%
  15 requests in 10.01s, 303.16KB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:      1.50
Transfer/sec:     30.30KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    63.00ms   39.01ms 232.75ms   82.09%
    Req/Sec     0.00      0.00     0.00    100.00%
  13 requests in 10.00s, 262.74KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      1.30
Transfer/sec:     26.27KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.86ms   43.65ms 197.73ms   66.67%
    Req/Sec     0.00      0.00     0.00    100.00%
  63 requests in 10.00s, 1.24MB read
Requests/sec:      6.30
Transfer/sec:    127.32KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.02ms   36.97ms 202.10ms   68.18%
    Req/Sec     0.00      0.00     0.00    100.00%
  94 requests in 10.00s, 1.86MB read
Requests/sec:      9.40
Transfer/sec:    189.95KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 12.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    93.89ms   48.95ms 249.73ms   73.72%
    Req/Sec     0.00      0.00     0.00    100.00%
  97 requests in 10.00s, 1.93MB read
Requests/sec:      9.70
Transfer/sec:    197.63KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.63ms   40.28ms 161.08ms   62.22%
    Req/Sec     0.00      0.00     0.00    100.00%
  86 requests in 10.00s, 1.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:      8.60
Transfer/sec:    173.78KB
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 12.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 12.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:      0.00
Transfer/sec:       0.00B
Running 10s test @ http://10.0.0.65:8080/test2.dat
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us  100.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  0 requests in 10.00s, 0.00B read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:      0.00
Transfer/sec:       0.00B